import React from "react";

import {useNavigate} from "react-router-dom";
// css
import '../../../common/css/NoticeView.css'

function NoticeViewPage() {

    const NoticeInfo = [
        {
            noticeTitle: "공지글",
            noticeContent: "오늘도 또 우리 수탉이 막 쫓기었다. 내가 점심을 먹고 나무를 하러 갈 양으로 나올 때이었다. 산으로 올라서려니까 등뒤에서 푸드득푸드득, 하고 닭의 횃소리가 야단이다. 깜짝 놀라서 고개를 돌려보니 아니나다르랴, 두 놈이 또 얼리었다.    점순네 수탉(은 대강이가 크고 똑 오소리같이 실팍하게 생긴 놈)이 덩저리 작은 우리 수탉을 함부로 해내는 것이다. 그것도 그냥 해내는 것이 아니라 푸드득하고 면두를 쪼고 물러섰다가 좀 사이를 두고 푸드득하고 모가지를 쪼았다. 이렇게 멋을 부려 가며 여지없이 닦아 놓는다. 그러면 이 못생긴 것은 쪼일 적마다 주둥이로 땅을 받으며 그 비명이 킥, 킥, 할 뿐이다. 물론 미처 아물지도 않은 면두를 또 쪼이며 붉은 선혈은 뚝뚝 떨어진다. 이걸 가만히 내려다보자니 내 대강이가 터져서 피가 흐르는 것같이 두 눈에서 불이 번쩍 난다. 대뜸 지게막대기를 메고 달려들어 점순네 닭을 후려칠까 하다가 생각을 고쳐먹고 헛매질로 떼어만 놓았다.  이번에도 점순이가 쌈을 붙여 놨을 것이다. 바짝바짝 내 기를 올리느라고 그랬음에 틀림없을 것이다. 고놈의 계집애가 요새로 들어서 왜 나를 못 먹겠다고 고렇게 아르릉거리는지 모른다.나흘 전 감자 건만 하더라도 나는 저에게 조금도 잘못한 것은 없다. 계집애가 나물을 캐러 가면 갔지 남 울타리 엮는 데 쌩이질을 하는 것은 다 뭐냐. 그것도 발소리를 죽여 가지고 등뒤로 살며시 와서, 얘! 너 혼자만 일하니? 하고 긴치 않는 수작을 하는 것이다.어제까지도 저와 나는 이야기도 잘 않고 서로 만나도 본체 만 척하고 이렇게 점잖게 지내던 터이련만 오늘로 갑작스레 대견해졌음은 웬일인가. 항차 망아지만 한 계집애가 남 일하는 놈 보구…….그럼 혼자 하지 떼루 하디? 내가 이렇게 내배앝는 소리를 하니까, 너 일하기 좋니? 또는,한여름이나 되거든 하지 벌써 울타리를 하니? 잔소리를 두루 늘어놓다가 남이 들을까 봐 손으로 입을 틀어막고는 그 속에서 깔깔댄다. 별로 우스울 것도 없는데 날씨가 풀리더니 이 놈의 계집애가 미쳤나 하고 의심하였다. 게다가 조금 뒤에는 제 집께를 할금 할금 돌아보더니 행주치마의 속으로 꼈던 바른손을 뽑아서 나의 턱밑으로 불쑥 내미는 것이다. 언제 구웠는 지 더운 김이 홱 끼치는 굵은 감자 세 개가 손에 뿌듯이 쥐였다. 느 집엔 이거 없지?  하고 생색 있는 큰소리를 하고는 제가 준 것을 남이 알면은 큰일날 테니 여기서 얼른 먹어 버리란다. 그리고 또 하는 소리가,너 봄 감자가 맛있단다.난 감자 안 먹는다. 너나 먹어라.는 고개도 돌리지 않고 일하던 손으로 그 감자를 도로 어깨 너머로 쑥 밀어 버렸다. 그랬더니 그래도 가는 기색이 없고, 뿐만 아니라 쌔근쌔근하고 심상치 않게 숨소리가 점점 거칠어진다. 이건 또 뭐야 싶어서 그때에야 비로소 돌아다보니 나는 참으로 놀랐다. 우리가 이 동네에 들어온 것은 근 삼 년째 되어 오지만 여태껏 가무잡잡한 점순의의 얼굴이 이렇게까지 홍당무처럼 새빨개진 법이 없었다. 게다가 눈에 독을 올리고 한참 나를 요렇게 쏘아보더니 나중에는 눈물까지 어리는 것이 아니냐. 그리고 바구니를 다시 집어들더니 이를 꼭 악물고는 엎어질 듯 자빠질 듯 논둑으로 횡하게 달아나는 것이다. 어쩌다 동리 어른이,너 얼른 시집을 가야지?   하고 웃으면,염려 마서유. 갈 때 되면 어련히 갈라구! 이렇게 천연덕스레 받는 점순이었다. 본시 부끄럼을 타는 계집애도 아니거니와 또한 분하다고 눈에 눈물을 보일 얼병이도 아니다. 분하면 차라리 나의 등어리를 바구니로 한번 모질게 후려쌔리고 달아날지언정.    그런데 고약한 그 꼴을 하고 가더니 그 뒤로는 나를 보면 잡아먹으려 기를 복복 쓰는 것이다. 설혹 주는 감자를 안 받아먹는 것이 실례라 하면, 주면 그냥 주었지 '느 집엔 이거 없지.'는 다 뭐냐. 그렇잖아도 저희는 마름이고 우리는 그 손에서 배재를 얻어 땅을 부치므로 일상 굽실거린다. 우리가 이 마을에 처음 들어와 집이 없어서 곤란으로 지낼 제 집터를 빌리고 그 위에 집을 또 짓도록 마련해 준 것도 점순 네의 호의였다. 그리고 우리 어머니 아버지도 농사 때 양식이 딸리면 점순이네한테 가서 부지런히 꾸어다 먹으면서 인품 그런 집은 다시 없으리라고 침이 마르도록 칭찬하곤 하는 것이다. 그러면서도 열 일곱씩이나 된 것들이 수군수군하고 붙어 다니면 동네의 소문이 사납다고 주의를 시켜 준 것도 또 어머니였다. 왜냐하면 내가 점순이 하고 일을 저질렀다가는 점순네가 노할 것이고, 그러면 우리는 땅도 떨어지고 집도 내쫓기고 하지 않으면 안되는 까닭이었다. 그런데 이놈의 계집애가 까닭없이 기를 복복 쓰며 나를 말려 죽이려고 드는 것이다.눈물을 흘리고 간 담날 저녁나절이었다. 나무를 한 짐 잔뜩 지고 산을 내려오려니까 어디서 닭이 죽는 소리를 친다. 이거 뉘집에서 닭을 잡나, 하고 점순네 울 뒤로 돌아오다가 나는 고만 두 눈이 똥그랬다. 점순이가 저희 집 봉당에 홀로 걸터앉았는데 이게 치마 앞에다 우리 씨암탉을 꼭 붙들어 놓고는, ffffffffffffffffffffffffffffff여기까지가 한계",
            noticeTime: "날짜: 2024.07.09 ",
            noticeView: "조회수: 1000",
        }
    ]

    const Navigate = useNavigate();

    return (
        <>
            <div className="noticeView">
                {NoticeInfo.map((noticeinfo) => (
                    <>
                        <div className="noticeViewHead">
                            {/* <!-- 공지글 제목 --> */}
                            <div className="noticeViewTitle">
                                {noticeinfo.noticeTitle}
                            </div>
                            <div className="noticeViewInfo">
                                {/* <!-- 날짜, 조회 --> */}
                                <span>{noticeinfo.noticeTime}</span>
                                <span>{noticeinfo.noticeView}</span>
                            </div>
                        </div>
                        <div className="noticeViewContent">
                            {/* <!-- 글 내용 --> */}
                            <textarea name="" id="" cols="30" rows="10" className="noticeText" readOnly>
                                {noticeinfo.noticeContent}
                            </textarea>
                        </div>
                        <div className="noticeViewBtn">
                            {/* <!-- 버튼 영역 --> */}
                            <div className="btn_left">
                                {/* <!-- 공간 정렬을 위한 빈 공간 --> */}
                            </div>
                            <div className="btn_center">
                                {/* <!-- 수정 삭제 버튼 --> */}
                                {/* <!-- 관리자한테만 보여질 수 있게 작성 --> */}
                                <button className="modify_btn" onClick={() => Navigate("/admin/Notice/Write")}>수정</button>
                                <button className="delete_btn">삭제</button>
                            </div>
                            <div className="btn_right">
                                <button className="back_to_list" onClick={() => Navigate("/user/Notice")}>목록으로<br /> 돌아가기</button>
                            </div>
                        </div>
                    </>

                ))}


            </div>


        </>
    );

}


export default NoticeViewPage;







