import React from 'react';
import '../../common/css/SignUp.css';




function SignUp() {















    return (


        <div className="wrap">
            <div className='signupheder'><h2>회원가입</h2></div>
           
            <form >
                <div className="inner">
                    {/* 아이디 */}
                    <div className='idDiv'>
                    <div className='username2'>아이디<input type="id"className='commonpage'/></div>
                    <button type="button"className='idbutton'>중복 확인</button>
                    </div>

                    {/* 비밀번호 */}
                    <div className='password2'>비밀번호  <input type="password"className='commonpage'/></div>
                    <div className='passwordcheck'>비밀번호 확인 <input type="password"className='commonpage'/></div>

                    {/* 이름 */}
                    <div className='name2'>이름  <input type="name"className='commonpage'/></div>

                    {/* <!-- 이메일 --> */}
                    <div className='emailDiv'>
                    <div className='email2'>이메일 <input type="email"className='commonpage'/></div>
                    <button type="button"className='idbutton'>이메일<br/>인증</button>
                    </div>
                    {/*이메일 받은 코드입력 */}
                    <div className='emailDiv'>
                    <div className='email2'>인증 코드 <input type="text"className='commonpage'/></div>
                    <button type="button"className='idbutton'>인증</button>
                    </div>
                    
                    {/* <!-- 생년월일 --> */}                 
                    <div className='bu'>생년월일 <input type="date"className='commonpage'/></div>
                    <div className="gender">

                        {/* <!-- 성별 --> */}
                        <div id="mg">
                            <label for="gender2">남녀선택</label>
                        </div>

                        <div className="asd">
                            <select id="gender" className="sel">
                                {/* <!-- 보낼 값 --> */}
                                <option value="남성">남성</option>
                                <option value="여성">여성</option>
                            </select>
                        </div>

                        {/* <!-- 남자는 value값 male 여자는 value값 female --> */}
                    </div>
                    <div className='phonnumber'>휴대폰 번호<input type="tel"className='commonpage'/></div>                    
                </div>
                        
                
                {/* <!-- 이용약관 --> */}
                <div className='textfile'>
                    <h3 className="title">이용약관</h3>
                    <div className="text">제1조(목적등)
                        ① 환경영향평가정보지원시스템 인터넷 회원 약관(이하 "본 약관" 이라 합니다)은 이용자가 환경영향평가정보지원시스템에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 합니다)를
                        이용함에 있어 이용자와 환경영향평가정보지원시스템에 권리·의무 및 책임사항을 규정함을 목적으로 합니다.
                        ② 이용자가 되고자 하는 자가 환경영향평가정보지원시스템이 정한 소정의 절차를 거쳐서 "회원가입" 단추를 누르면 본 약관에 동의하는 것으로 간주합니다. 본 약관에 정하는 이외의
                        이용자와 환경영향평가정보지원시스템에 권리, 의무 및 책임사항에 관해서는 전기통신사업법 기타대한민국의 관련법령과 상관습에 의합니다.
                        제2조(이용자의 정의)
                        "이용자"란 환경영향평가정보지원시스템 홈페이지에 접속하여 본 약관에 따라 환경영향평가정보지원시스템 인터넷 회원으로 가입하여 환경영향평가정보지원시스템 인터넷 회원 서비스를 받는 자를
                        말합니다.

                        제3조 (회원 가입)
                        ① 이용자가 되고자 하는 자는 환경영향평가정보지원시스템이 정한 가입 양식에 따라 회원정보를 기입하고 "회원가입" 단추를 누르는 방법으로 회원 가입을 신청합니다.
                        ② 환경영향평가정보지원시스템은 제1항과 같이 회원으로 가입할 것을 신청한 자가 다음 각 호에 해당하는 경우 회원등록을 거부할 수 있고 기입한 데이터를 삭제할 수 있습니다.
                        1. 가입신청자가 본 약관 제6조 제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우. 다만 제6조 제3항에 의한 회원자격 상실 후 3년이 경과한 자로서
                        환경영향평가정보지원시스템에 회원재가입 승낙을 얻은 경우에는 예외로 합니다.
                        2. 등록 내용에 허위, 기재누락, 오기가 있는 경우
                        3. 기타 회원으로 등록하는 것이 환경영향평가정보지원시스템에 기술상 현저히 지장이 있다고 판단되는 경우
                        ③ 회원가입계약의 성립시기는 환경영향평가정보지원시스템에 승낙이 가입신청자에게 도달한 시점으로 합니다.
                        ④ 회원은 제1항의 회원정보 기재 내용에 변경이 발생한 경우, 즉시 변경사항을 정정하여 기재하여야 합니다.
                        제4조(서비스의 제공 및 변경)
                        ① 환경영향평가정보지원시스템 인터넷 회원 서비스는 이용자에게 아래와 같은 서비스를 제공합니다.
                        1. 연구보고서 원문 서비스
                        2. GIS & RS 자료 서비스
                        3. 신규자료 업로드시 메일 통보 서비스
                        4. 환경웹진 발행
                        5. 환경전문인력 DB 이용
                        6. 기타 환경영향평가정보지원시스템이 회원들에게 제공할 일체의 서비스
                        ② 환경영향평가정보지원시스템은 그 변경될 서비스의 내용 및 제공일자를 제7조 제2항에서 정한 방법으로 이용자에게 통지하고, 제1항에 정한 서비스를 변경하여 제공할 수 있습니다.
                        제5조(서비스의 중단)
                        ① 환경영향평가정보지원시스템은 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있고, 새로운
                        서비스로의 교체 기타 환경영향평가정보지원시스템이 적절하다고 판단하는 사유에 기하여 현재 제공되는 서비스를 완전히 중단할 수 있습니다.
                        ② 제1항에 의한 서비스 중단의 경우에는 환경영향평가정보지원시스템은 제7조 제2항에서 정한 방법으로 이용자에게 통지합니다. 다만, 환경영향평가정보지원시스템이 통제할 수 없는 사유로
                        인한 서비스의 중단(시스템 관리자의 고의, 과실이 없는 디스크 장애, 시스템 다운 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.
                        제6조(이용자 탈퇴 및 자격 상실 등)
                        ① 이용자는 환경영향평가정보지원시스템에 언제든지 자신의 회원 등록을 말소해 줄 것(이용자 탈퇴)을 요청할 수 있으며 환경영향평가정보지원시스템은 위 요청을 받은 즉시 해당 이용자의
                        회원 등록 말소를 위한 절차를 밟습니다.
                        ② 이용자가 다음 각 호의 사유에 해당하는 경우, 환경영향평가정보지원시스템은 이용자의 회원자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있습니다.
                        1. 가입 신청 시에 허위 내용을 등록한 경우
                        2. 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
                        3. 서비스를 이용하여 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
                        ③ 환경영향평가정보지원시스템이 이용자의 회원자격을 상실시키기로 결정한 경우에는 회원등록을 말소합니다. 이 경우 이용자인 회원에게 회원등록 말소 전에 이를 통지하고, 소명할 기회를
                        부여합니다.
                        제7조(이용자에 대한 통지)
                        ① 환경영향평가정보지원시스템이 특정 이용자에 대한 통지를 하는 경우 회원가입 시 기입한 메일주소로 할 수 있습니다.
                        ② 환경영향평가정보지원시스템이 불특정다수 이용자에 대한 통지를 하는 경우 1주일이상 환경영향평가정보지원시스템 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.
                        제8조(이용자의 개인정보보호)
                        환경영향평가정보지원시스템은 관련법령이 정하는 바에 따라서 이용자 등록정보를 포함한 이용자의 개인정보를 보호하기 위하여 노력합니다. 이용자의 개인정보보호에 관해서는 관련법령 및
                        환경영향평가정보지원시스템이 정하는 "개인정보보호정책"에 정한 바에 의합니다.

                        제9조(환경영향평가정보지원시스템에 의무)
                        ① 환경영향평가정보지원시스템은 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 본 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하기 위해서
                        노력합니다.
                        ② 환경영향평가정보지원시스템은 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보 보호를 위한 보안 시스템을 구축합니다.
                        ③ 이용자는 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 환경영향평가정보지원시스템에 통보하고 환경영향평가정보지원시스템에 안내가 있는
                        경우에는 그에 따라야 합니다.
                        제10조(이용자의 의무)
                        ① 이용자는 다음 각 호의 행위를 하여서는 안됩니다.
                        1. 회원가입신청 또는 변경시 허위내용을 등록하는 행위
                        2. 서비스에 게시된 정보를 변경하는 행위
                        3. 환경영향평가정보지원시스템 기타 제3자의 인격권 또는 지적재산권을 침해하거나 업무를 방해하는 행위
                        4. 다른 회원의 ID를 도용하는 행위
                        5. 환경영향평가정보지원시스템 원장의 승인 없이 자료의 무단 복제, 배부 임의 변경하거나 가공 또는 판매하거나 기타 영리를 목적으로 사용하는 행위
                        6. 관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보의 전송 또는 게시하는 행위
                        7. 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는
                        자료를 게시하거나 전자우편으로 발송하는 행위
                        8. 다른 이용자에 대한 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
                        9. 환경영향평가정보지원시스템이 제공하는 서비스에 정한 약관 기타 서비스 이용에 관한 규정을 위반하는 행위
                        ② 제1항에 해당하는 행위를 한 이용자가 있을 경우 환경영향평가정보지원시스템은 본 약관 제6조 제2, 3항에서 정한 바에 따라 이용자의 회원자격을 적절한 방법으로 제한 및 정지,
                        상실시킬 수 있습니다.
                        ③ 이용자는 그 귀책사유로 인하여 환경영향평가정보지원시스템은 다른 이용자가 입은 손해를 배상할 책임이 있습니다.
                        제11조(저작권의 귀속 및 이용제한)
                        ① 환경영향평가정보지원시스템이 작성한 저작물에 대한 저작권 기타 지적재산권은 환경영향평가정보지원시스템에 귀속합니다.
                        ② 이용자는 서비스를 이용함으로써 얻은 정보를 환경영향평가정보지원시스템 원장의 사전승낙 없이 자료의 무단 복제, 배부 임의 변경하거나 가공 또는 판매하거나 기타 영리를 목적으로
                        사용하여서는 안됩니다.
                        제12조 (약관의 개정)
                        ① 환경영향평가정보지원시스템은 약관의 규제 등에 관한법률, 전자거래기본법, 전자서명법, 정보통신망이용촉진등에관한법률 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수
                        있습니다.
                        ② 환경영향평가정보지원시스템이 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.
                        ③ 환경영향평가정보지원시스템이 본 약관을 개정할 경우에는 그 개정약관은 개정된 내용이 관계 법령에 위배되지 않는 한 개정 이전에 회원으로 가입한 이용자에게도 적용됩니다.
                        ④ 변경된 약관에 이의가 있는 이용자는 제6조 제1항에 따라 탈퇴할 수 있습니다.
                        제13조(재판관할)
                        환경영향평가정보지원시스템과 이용자간에 발생한 서비스 이용에 관한 분쟁으로 인한 소는 민사소송법상의 관할을 가지는 대한민국의 법원에 제기합니다.

                    </div>
                    {/* <!-- 동의 버튼 --> */}
                    <label className="custom-checkbox">
                        <input type="checkbox" required />
                        <span className="checkmark">동의(필수)</span>
                    </label>
                </div>

                {/* <!-- 가입하기 버튼 --> */}
                <button type="submit"className='signupsubmit'>회원가입</button>
            </form>
        </div>











    );
}


export default SignUp;